microchip-pic-avr-examples/dspic33a-dual-partition-code-examples/dspic33ak512mps512_dual_partition_demo/example0/shared_code/command.c
    /* cppcheck-suppress misra-c2012-11.6
     *
     *  (Rule 11.6) REQUIRED: A cast shall not be performed between
     *  pointer to void and an arithmetic type
     *
     *  Reasoning: This copies the sequence code value of the requested
     *  partition into the sequenceCode buffer. Because the address may live
     *  outside of active partition, there is no way to create an object at
     *  that address to reference so an integer address is used.
     */
    memcpy(sequenceCode, (void*)address, sizeof(sequenceCode));

    info->address = address;
    info->sequenceNumber = (uint16_t)(sequenceCode[0] & 0xFFFU);
    info->inverseSequenceNumber = (uint16_t)((sequenceCode[0] >> 12) & 0xFFFU);
    info->valid = SequenceCodeIsValid(sequenceCode);
}

/**
 * @ingroup  menu.c
 * @brief    Returns "Valid" or "Invalid" for sequence number display.
 *
 * @param    valid - validity state
 * @return   const char* - validity string
 */
static const char* ValidStringGet(bool valid)
{
    if(valid)
    {
        return "Valid";
    }
    else
    {
        return "Invalid";
    }
}

/**
 * @ingroup  menu.c
 * @brief    Prints one row of the sequence number table.
 *
 * @param    partitionNumber - current partition number
 * @param    stateLabel - displayed state label ("Active" or "Inactive")
 * @param    address - sequence number address
 * @return   none
 */
static void SequenceInfoRowPrint(uint8_t panelNumber, const char *stateLabel, uint32_t address)
{
    struct SEQUENCE_INFO info;

    SequenceInfoGet(address, &info);

    (void)printf("  %-*s | %-*s | %-*.3X | %-*.3X | %-*s | 0x%06lX\r\n",
                 SEQINFO_PARTITION_WIDTH,
                 (panelNumber == 1U) ? "Partition 1" : "Partition 2",
                 SEQINFO_STATE_WIDTH,
                 stateLabel,
                 SEQINFO_SEQNUM_WIDTH,
                 (unsigned int)info.sequenceNumber,
                 SEQINFO_INVSEQNUM_WIDTH,
                 (unsigned int)info.inverseSequenceNumber,
                 SEQINFO_VALID_WIDTH,
                 ValidStringGet(info.valid),
                 (unsigned long)info.address);
}

/**
 * @ingroup  menu.c
 * @brief    Prints sequence number information for active and inactive partitions
 *           in a table format. 
 *
 * @param    none
 * @return   none
 */
static void SequenceInfoPrint(void)
{
    (void)printf("  Sequence Number\r\n");
    (void)printf("  --------------------------------------------------------------------------------------\r\n");
    (void)printf("  %-*s | %-*s | %-*s | %-*s | %-*s | %-*s\r\n",
                 SEQINFO_PARTITION_WIDTH, "Partition Number",
                 SEQINFO_STATE_WIDTH, "Active/Inactive",
                 SEQINFO_SEQNUM_WIDTH, "Seq. Num.",
                 SEQINFO_INVSEQNUM_WIDTH, "Inverse Seq. Num.",
                 SEQINFO_VALID_WIDTH, "Valid",
                 SEQINFO_ADDRESS_WIDTH, "Address");

    SequenceInfoSeparatorPrint();

    SequenceInfoRowPrint(PARTITION_ActiveGet(), "Active", ACTIVE_SEQUENCE_NUMBER_ADDRESS);
    SequenceInfoRowPrint(PARTITION_InactiveGet(), "Inactive", INACTIVE_SEQUENCE_NUMBER_ADDRESS);
}

static void PrintRepeatedChar(char ch, uint8_t count)
{
    uint8_t i;

    for(i = 0U; i < count; i++)
    {
        (void)putchar((int)ch);
    }
}

static void SequenceInfoSeparatorPrint(void)
{
    (void)printf("  ");
    PrintRepeatedChar('-', SEQINFO_PARTITION_WIDTH);
    (void)printf(" | ");
    PrintRepeatedChar('-', SEQINFO_STATE_WIDTH);
    (void)printf(" | ");
    PrintRepeatedChar('-', SEQINFO_SEQNUM_WIDTH);
    (void)printf(" | ");
    PrintRepeatedChar('-', SEQINFO_INVSEQNUM_WIDTH);
    (void)printf(" | ");
    PrintRepeatedChar('-', SEQINFO_VALID_WIDTH);
    (void)printf(" | ");
    PrintRepeatedChar('-', SEQINFO_ADDRESS_WIDTH);
    (void)printf("\r\n");
}
